{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Adventures in Jeffland",
  "language": "en",
  "home_page_url": "https://jeffcoburn.com/",
  "feed_url": "https://jeffcoburn.com/feed/feed.json",
  "description": "Stuff that is either about me or written by me.",
  "author": {
    "name": "Jeff Coburn",
    "url": "https://jeffcoburn.com/about-me/"
  },
  "items": [{
      "id": "https://jeffcoburn.com/posts/til/sharp/",
      "url": "https://jeffcoburn.com/posts/til/sharp/",
      "title": "TIL - How I Fixed Endless Sharp Module Errors in Gatsby",
      "content_html": "<p>Dear Future Jeff,</p>\n<p>The next time your Gatsby dependencies fall apart like stairs falling down stairs, you might just try this (which just worked for us).</p>\n<code>\n  brew remove vips\n  rm -rf node_modules\n  yarn install\n</code>\n<p>We found this <a href=\"https://stackoverflow.com/questions/67560211/mac-m1-something-went-wrong-installing-the-sharp-module\">here</a>.</p>\n<p>I'm certain we've actually had and solved this problem before, so that is why I'm just going to leave this note for you.</p>\n",
      "date_published": "2023-02-07T00:00:00Z"
    },{
      "id": "https://jeffcoburn.com/posts/weeknotes/11-27-2022/",
      "url": "https://jeffcoburn.com/posts/weeknotes/11-27-2022/",
      "title": "WeekNotes - Nov 27, 2022",
      "content_html": "<p>Super chill TDay weekend; no travel, and a very favorable pie/visitor ratio. The kids are old enough where they have interests that don't involve an adult's direct involvement, so there was a lot of people doing things they liked. Baking, reading, building, puttering, gaming, snacking, etc. I wore my favorite sweatshirt a lot. It's not to say I didn't do anything productive. I helped my father-in-law blow in insulation into an attic for 4 hours, I got my lumberjack on with some backyard trees, I even participated in the first annual neighborhood Thanksgiving morning football game. A++ would do again.</p>\n<h3 id=\"projects\">Projects <a class=\"direct-link\" href=\"#projects\">#</a></h3>\n<ul>\n<li>broke out my electric chainsaw and got after some felled trees.</li>\n<li>Tried to get my outdoor lights to be &quot;smart&quot; again. Really need the Matter protocol to be a thing, soonish.</li>\n<li>Messed about moving my social graph off of bird site and onto elephant site.</li>\n<li>Assembled a tumbler composting bin. Rhone-Dogg learned all about composting in his second grade class, so we are giving it a go.</li>\n<li>Trying to as many quests done in fortnite before this season ends (I am the best 17-year-old ever).</li>\n</ul>\n<h1 id=\"read\">Read <a class=\"direct-link\" href=\"#read\">#</a></h1>\n<ul>\n<li><a href=\"https://www.goodreads.com/book/show/24611819-the-peripheral\"><strong>The Peripheral</strong></a>. I have read a lot of William Gibson books (as a good little nerd), and this is pretty good. The world-collapsing &quot;jackpot&quot; the story is centered around is disturbing in that Gibson has been pretty spot-on with his visions of the future. Do not want. I actually put this book down for a while but picked back up in time to finish it before the start of the TV Series.</li>\n</ul>\n<h1 id=\"watched\">Watched <a class=\"direct-link\" href=\"#watched\">#</a></h1>\n<ul>\n<li>\n<p><a href=\"https://www.imdb.com/title/tt8291284/\"><strong>The Peripheral</strong></a>. Seven episodes in and I am enjoying it. A good balance of taking from the book, and adapting it to screen. I was really not seeing how this book would ever be comprehensible on screen, but they have done of great job at adapting it.</p>\n</li>\n<li>\n<p><strong>Mythic Quest</strong> Season 3 (Apple TV +). I've gone on the record saying this show is better than Ted Lasso, and I stand by my words. Really funny, good take on technology, and the characters have interesting and funny arcs.</p>\n</li>\n<li>\n<p><strong>Andor</strong> (Disney +). Really good. This, and season 2 of The Mandalorian would be the only Star Wars shows I would say that about.</p>\n</li>\n<li>\n<p>Made it one episode into Ring Of Power. Nah.</p>\n</li>\n</ul>\n",
      "date_published": "2022-12-27T00:00:00Z"
    },{
      "id": "https://jeffcoburn.com/posts/2022/no/",
      "url": "https://jeffcoburn.com/posts/2022/no/",
      "title": "piss off",
      "content_html": "<p>I got home from the bar hammered and I just wanted you to know I did my blog post.</p>\n",
      "date_published": "2022-11-11T00:00:00Z"
    },{
      "id": "https://jeffcoburn.com/posts/2022/himself/",
      "url": "https://jeffcoburn.com/posts/2022/himself/",
      "title": "Textism",
      "content_html": "<p>Readers of this site might notice that I refer to my partner, who has an actual name, as Herself. I do this for two reasons. One reason is that it seems to annoy her, as she feels I am oddly private about her. I am not. I am tastefully private about her. The other reason I use the term is as a nod to my favorite web writer, (calling him a blogger seems an insult) Dean Allen. He always referred to his partner as Herself. The reason I started writing was because I wanted to write like him and <a href=\"https://lancearthur.medium.com/\">Lance Arthur</a>. (You might not believe this but I actually wrote near-daily for 5 years).</p>\n<p>Dean was a heartbreakingly talented writer. His ability to make his prose show adoration for the things he loved and disdain for the things he didn't, will go unmatched. So using the term on my stupid site is to honor him; and it makes me happy.</p>\n<p>Dean, like all things too good for this world, is <a href=\"https://kottke.org/18/01/rest-in-peace-dean-allen\">gone now</a>. But I would encourage anyone to spend an hour or so digging through his <a href=\"https://web.archive.org/web/20030203222323/http://www.textism.com/\">archived</a> <a href=\"https://web.archive.org/web/20010205000100/http://cardigan.com/\">stuff</a>.</p>\n",
      "date_published": "2022-11-10T00:00:00Z"
    },{
      "id": "https://jeffcoburn.com/posts/2022/it_burns/",
      "url": "https://jeffcoburn.com/posts/2022/it_burns/",
      "title": "Cool Kids Candy",
      "content_html": "<p>Herself, returned from a trip to the University she is employed by, handed me a pack of strange candy.</p>\n<blockquote>\n<p>&quot;I got you this. I was in line at the campus store and every single kid in front of me grabbed a pack of this at the register. I know you love to keep up with what the kids are into.&quot;</p>\n</blockquote>\n<p>I thought about nothing else since. Was it a generous, thoughtful act? Was it the the sickest of sick burns? I feel like this could literally trigger my impeding mid-life crisis.</p>\n",
      "date_published": "2022-11-09T00:00:00Z"
    },{
      "id": "https://jeffcoburn.com/posts/2022/reinforced_bubble/",
      "url": "https://jeffcoburn.com/posts/2022/reinforced_bubble/",
      "title": "Reinforced Bubbles",
      "content_html": "<p>One of the concepts that was transmitted on repeat over the past decade is the idea of social media forming bubbles where you only see political/cultural content that already jives with what you already believe. Surely that is true, but you still shared the same platform with people who you might wildly disagree with, even if they only content you might have seen was fodder for lolz.</p>\n<p>I have a hunch that as FB and Twitter start have a bit of an exodus, people seem to be replacing them with platforms that entirely jive with their general world view. I'm not drawing any equivalency between Mastodon and TruthParlorBagofShit, but it does seem that as we choose platforms we are choosing sides.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/AE7IMHRjbeQ\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>",
      "date_published": "2022-11-08T00:00:00Z"
    },{
      "id": "https://jeffcoburn.com/posts/2022/hottakes1/",
      "url": "https://jeffcoburn.com/posts/2022/hottakes1/",
      "title": "Hot Takes No. 1",
      "content_html": "<ol>\n    <li>Mythic Quest is a better show than Ted Lasso. \"Quarantine\", \"Everlight\" and flashback episodes like \"A Dark Quiet Death\" and \"Backstory!\" don't get the love they deserve.</li>\n    <li>Microsoft Outlook for the Web is a better product than Gmail. Just as good interface and keyboard shortcuts, more robust extension support and Power Automate makes it killer.</li>\n    <li>Light VS Code themes are superior to dark themes. I am old.</li>\n</ol>",
      "date_published": "2022-11-07T00:00:00Z"
    },{
      "id": "https://jeffcoburn.com/posts/2022/mastodon/",
      "url": "https://jeffcoburn.com/posts/2022/mastodon/",
      "title": "Mastodon",
      "content_html": "<p>Twitter et al seems like it's working through some issues. I have no loyalty to it, of course, but I do think it's a shame. I have a lovely little network of friendly and supportive folks that have made pandemic-induced isolation much more tolerable. Most of them have been in my life for a decade or more. It's fair to say that none of this would have happened without Twitter. I also love dumb joke and watching people out themselves as fools.</p>\n<p>But if you get the sense your car is gonna shit the bed, it's not a bad idea to take a look around the car market. Mastodon is the most interesting player that I've seen.</p>\n<p><strong>PROS</strong></p>\n<ul>\n<li>It's been taken up by mostly people I want to be around. And I have a lot of control over what I see.</li>\n<li>No ads, no brand engagement.</li>\n<li>pretty geeky with its servers and federation and what not.</li>\n<li>I have control of my timeline view, so I don't get the sense that there is a corporation pricking me to see how I react.</li>\n</ul>\n<p><strong>CONS</strong></p>\n<ul>\n<li>It lacks the viral/addictive aspect [a better person would put that in the PROS]. Because I haven't spent 15 years training twitter to give me what I want, I find myself less amused with my mastodon timeline. I think this is ultimately a good thing, but it could be why it doesn't end up taking with me.</li>\n<li>While I appreciate the geekyness of the whole thing, the learning curve is more than I'm used to for a social media product.</li>\n<li>The instance I set up my account has some classic Fail Whale. This probably means I should throw some money their way.</li>\n</ul>\n<p>Anywho, I'm at <a href=\"https://mastodon.social/@coburnicus\">https://mastodon.social/@coburnicus</a> if you want to find me.</p>\n",
      "date_published": "2022-11-06T00:00:00Z"
    },{
      "id": "https://jeffcoburn.com/posts/2022/dream-big/",
      "url": "https://jeffcoburn.com/posts/2022/dream-big/",
      "title": "Dream Big",
      "content_html": "<p>Today I was at the shop picking up some beverages for this evening. The two people in front of me bought PowerBall tickets.</p>\n<blockquote>\nMe: Did anybody win the PowerBall yet?\n<p>Her: Nope, it's a record high.</p>\n<p>Me: I'm game.</p>\n<p>Her: So 10 or 20 tickets?</p>\n<p>Me: ...Just one.</p>\n</blockquote>\n<hr>\nTonight I went around the table and asked everybody what the <i>first</i> thing you would buy with the money.\n<blockquote>\nHerself: Pay off the house.\n<p>R(7): Go to a water park...for a month!</p>\n<p>W(10): Give it to charity</p>\n</blockquote>\nFor the record I would pay off the house and then take R & W to a water park for a month.",
      "date_published": "2022-11-05T00:00:00Z"
    },{
      "id": "https://jeffcoburn.com/posts/2022/The-way-i-dont-see-it/",
      "url": "https://jeffcoburn.com/posts/2022/The-way-i-dont-see-it/",
      "title": "The Way I Don&#39;t See It",
      "content_html": "<p>One of the things that draws me toward technology is that if something doesn't work they way you want, you can probably do something about it. Have a hard time reading dark text off a light background? Enable dark mode or run your own stylesheet. Have a cluttered background in your office on zoom calls? Put a different background behind you. Fixing a problem is a very rewarding feeling. Running into a wall fixing problems is the opposite of that.</p>\n<p>Some problems are dumb but I'll just live with them. My HomePod Mini loudly repeating every command back to me, even if it is 2am, is not ideal. Siri being willfully unaware of Google/Nest products on the same network, also is shit. Those are the pitfalls of buying things inside the &quot;walled garden.&quot; But there is a series of problems that I am running into that are increasingly unacceptable: Text size.</p>\n<p>I am one of the sad souls in a pub, shining a phone flashlight on the menu. Even sadder, I am probably looking at the phone screen, using the camera zoom to magnify. I now have reading glasses in nearly every room in the house and both cars. Turns out you can buy them in bulk. But I don't always have reading glasses on me, because if the text is big enough, I can manage. I like to control font size per device, per app. I set VS Code has a reasonable font size, same with my my email app. But a few things don't let you control text at every level I need it. And because nearly everything in my life is Apple, I'm often grumpy with them.</p>\n<p>Current walls include:</p>\n<ul>\n<li>The new weather-themed lock screen widgets on iOS 16. BOOOOOOOOO</li>\n<li>Any of the more useful Apple Watch complications. BOOOOOOOOO</li>\n<li>Message text inside the gmail app (not notifications and not the inbox, the actual message). <em>Yes there are other email apps, but I watch live tv sports with remote mates, and the official gmail app is the only one that &quot;pushes&quot; messages.</em></li>\n</ul>\n<p>The fact that I can't control the text size tells me that Apple isn't valuing that. And they should. I can't imagine I am the only person who is starting to look over the garden wall for solutions.</p>\n",
      "date_published": "2022-11-04T00:00:00Z"
    },{
      "id": "https://jeffcoburn.com/posts/2022/I-Heart-PWAs/",
      "url": "https://jeffcoburn.com/posts/2022/I-Heart-PWAs/",
      "title": "I 	Heart PWAs",
      "content_html": "<p>Two ideas exist in opposition, on my laptop.</p>\n<ol>\n<li>I like the web, and it's open standards (HTML, CSS, JS, etc)</li>\n<li>I prefer tools I use a lot to be native. This means I would rather have an email application that I open, rather than have my email as a tab in my browser.</li>\n</ol>\n<p>Luckily there is a loophole. Enter <em><a href=\"https://developer.mozilla.org/en-US/docs/Web/Progressive_web_apps\">Progressive Web Apps (PWAs)</a></em>. If you couldn't gather from the link, PWA's allow you to &quot;install&quot; a webpage on your device the way you would an app. Looking at my desktop now, I currently have four PWAs running (Outlook, Gmail, Planner, and SeeSaw (an app communicate with teachers/schools)). For <em>reasons</em> I also often use Slack and Twitter as PWAs as well. For tools that I need to use often, I prefer to cmd-tab to the app, rather then find them in the roughly 1400 open tabs in my browser. This allows me to use the web versions of these tools, and have dedicated instances for each .</p>\n<p>Currently, I use <a href=\"https://brave.com/\">Brave</a> a privacy-focused fork of Chrome. When combined with <a href=\"https://ublockorigin.com/\">uBlock Origin</a>, the ad blocker, I have a lot of control over what gross corporations track me about the web. You should be able to make your PWAs with any version of chrome. I don't believe Firefox or Safari allow PWAs, which is a shame, as I use Firefox heavily as well.</p>\n",
      "date_published": "2022-11-03T00:00:00Z"
    },{
      "id": "https://jeffcoburn.com/posts/2022/whats-the-name-again/",
      "url": "https://jeffcoburn.com/posts/2022/whats-the-name-again/",
      "title": "Names, my worst enemy",
      "content_html": "<p>Lots of people say they are bad with names, but I am truly awful at names. Not all names. Like, if you need me to name the entire batting order of the '88 Red Sox, I'm all over it. But in meaningful instances, I'm a lost cause. The other night we hosted a bunch of folks for a pre-game halloween party and I had to introduce two couples to each other, and I batted .500. This sketch is just my daily life.</p>\n<center>\n<iframe style=\"max-width:800px;\" src=\"https://www.youtube.com/embed/rImxuuD_kwM\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n</center>\n<p>This leads me to the current book I'm reading, <a href=\"https://www.goodreads.com/book/show/58662507-nona-the-ninth\">Nona The Ninth</a> (The Locked Tomb #3). To be clear, I love this series. But this book is just a near constant reminder that I am shit with names. If I didn't know better, I would say this book went out of the way to specifically fuck with me. Some aggravating factors:</p>\n<ul>\n<li>Too many names. Well over 50 meaningful characters at this point. I'm good with something closer to ... five.</li>\n<li>Multiple Characters that start with the same letter. Internally my mind reads &quot;the C name&quot; which doesn't work when three character's names begin with C.</li>\n<li>Characters names change over the course of the series. Coronabeth is now Crown, etc.</li>\n<li>Separate characters now share bodies. I give up.</li>\n</ul>\n<p>I will say this book has some pretty great names (We Suffer, Born in the Morning, Noodle). Anyway, I'm off to read more because, again, it's a pretty great book.</p>\n",
      "date_published": "2022-11-02T00:00:00Z"
    },{
      "id": "https://jeffcoburn.com/posts/2022/what-goes-in-my-bag/",
      "url": "https://jeffcoburn.com/posts/2022/what-goes-in-my-bag/",
      "title": "What Goes In My Travel Bag",
      "content_html": "<p>It might surprise absolutely nobody that I can be little particular about my gear for traveling. So today I'll dive a bit into how I packed for a recent 4 day/3 Night, work trip with some socializing as well. I don't do <em>businessing</em> or anything the requires a proper suit. But I try to look decent, and ready for everything a trip could hold in store. I pack in one backpack, which is carry-on. So everything that follows is either on me or in that bag. I value:</p>\n<ul>\n<li>things that can be re-worn,</li>\n<li>are packable,</li>\n<li>and work in inclement weather.</li>\n</ul>\n<p><strong>The Bag</strong> is a 20 year old NorthFace Recon. It's not perfect, but it hasn't given me any real reasons to replace it (this is a theme in my life). Legend has it this was actually my wife's bag, but somehow became my bag. I can neither confirm nor deny this rumor. It doesn't have a dedicated laptop pocket (just a flimsy sleeve) and its not really waterproof. But is has the right amount of pockets (1 big, 1 medium, 1 small) and deep side pockets for water bottles. If I traveled more I might consider replacing it.</p>\n<h3 id=\"tech-gear\">Tech Gear <a class=\"direct-link\" href=\"#tech-gear\">#</a></h3>\n<ul>\n<li>\n<p><strong>Laptop</strong> Macbook Pro 16″. A sixteen inch laptop is not optimal to travel with. Doesn't fit on table/trays well, doesn't slid into the bag well, is bulky and heavy. If I traveled more, or had a redo, I might have gone with the 14″. It's a year old, so the battery lasts forever. That is nice.</p>\n</li>\n<li>\n<p><strong>iPhone</strong> but of course. But, I switched over to a cheaper VZW pre-paid plan during quarantine times because I rarely left home, let alone town. The phone plan sucks ass so hard. It always fails me when I need it most, so I end up having to find sketchy wifi to access gMaps to unfuck myself. It added stress.</p>\n</li>\n<li>\n<p><strong>Cables</strong> I bought an <a href=\"https://www.amazon.com/dp/B09C5RG6KV/ref=emc_b_5_i\">Anker 3 port charger</a> and that is it for chargers. It replaces a bunch of gear, and charges my laptop, phone, and watch, but I am iffy on how well it was handling it. If it didn't have all night to charge all three, it might have let me down. So far so good.</p>\n</li>\n<li>\n<p><strong>Big-ass Bose headphones</strong> this is a splurge in cost, but also in weight. It's the second biggest thing I packed. I could probably just use earbuds, but I really like to block out noise. I seem to be a magnet for loud unstable people to work through their issues five feet away from me, so the ability to block out the world is pretty valuable.</p>\n</li>\n<li>\n<p><strong>Kindle PaperWhite</strong> Runs forever, no glare, and it fits inside the Bose headphone case. So I can grab that case and put my backpack in overhead on a plane, and I'll have plenty to watch, read, listen (when combined with my phone).</p>\n</li>\n</ul>\n<h3 id=\"clothes-gear\">Clothes gear <a class=\"direct-link\" href=\"#clothes-gear\">#</a></h3>\n<ul>\n<li>\n<p><strong>Waterproof shell</strong> Mine is not very waterproof and will be replaced soon. I'm not going to be afraid to go all in for this purchase because being warm and dry is very important, especially when you are packing minimal amounts of clothing. It rained this morning and I am sitting on an Amtrak train, a little damp, and that is a bummer.</p>\n</li>\n<li>\n<p><strong><a href=\"https://www.blundstone.com/rustic-black-leather-chelsea-boots-mens-style-587\">Blundstone Boots</a></strong> These are near perfect. They go with whatever you are wearing (can look casual or dressy), comfy enough to do real miles, easy on/off during air travel security theatre hour, and can be waterproof with the right treatment. I stopped tricking myself into believing that I might go to the hotel gym, so now I only bring these.</p>\n</li>\n<li>\n<p><strong><a href=\"https://www.eddiebauer.com/p/13407854/mens-voyager-20-travel-blazer\">Travel Blazer</a></strong> Works for work stuff, conference attire (I am a code monkey but have to cosplay in government and academia). Wore it out for social stuff. It's packable. Just a useful and functional garment.</p>\n</li>\n<li>\n<p><strong>2 pair of pants</strong> You <em>could</em> roll with one pair, surely. But that seems...risky. <a href=\"https://www.kuhl.com/kuhl/mens/pants/resistor-jean/\">One pair</a> is something people use to scale mountain rock faces, but I use to build websites (I've dubbed this concept &quot;tactical office wear&quot;). One pair is black jeans with some stretch (that is just how I like them). Slim black jeans and a blazer can look pretty dressy, so that adds some versatility.</p>\n</li>\n</ul>\n<p><strong>Two light weight Merino wool sweaters</strong><br>\n<strong>Two collared shirts</strong><br>\n<strong>Two light weight merino wool t-shirts</strong> (maybe with spandex blend)<br>\n<strong>Two pair merino wool light hiking socks</strong></p>\n<p>You are picking up on a trend here, yes? I alternate through these and they stay looking nice, and just as important, smelling nice. Merino wool is apparently some sort of magic material that cost $100 per inch but seems to be worth it.</p>\n<p>Two sweaters might be excessive, I might replace one with a classic tech-bro vest for another layer of warmth and some more versatility.</p>\n<p>Of course pack as many pairs of underwear as there are days in your trip. Some things are immune to travel hacks.</p>\n<p>There is nothing remarkable about my toiletries, except that I use a <a href=\"https://www.usa.philips.com/c-m-pe/oneblade-trim-edge-and-shave#triggername=options_2b6m\">OneBlade</a> and that means I don't have to bring shaving cream.</p>\n<p>That's it. I'll probably edit this page as I change my method/habits.</p>\n",
      "date_published": "2022-11-01T00:00:00Z"
    },{
      "id": "https://jeffcoburn.com/posts/ireland2022/",
      "url": "https://jeffcoburn.com/posts/ireland2022/",
      "title": "Ireland 2022 (the craic was mighty)",
      "content_html": "<h1 id=\"pre-launch\">Pre Launch <a class=\"direct-link\" href=\"#pre-launch\">#</a></h1>\n<p>We got this trip off to a weird start because we booked the trip in January (before the huge price jump/gouge. Yeah!) for the weekend after the kids school let out, but then they had four more snow days and therefore we missed the last four school days. It seemed like they missed a bunch of movies and field days so it was probably fine. Thankfully, it seems we are the only people on the planet who flew to and from a destination and had no delays or lost luggage. I would not push my luck and try that again, for the time being. We also flew on Aer Lingus, which is a million times better than last time when we flew Norwegian Airlines. Norwegian decided that our flight would leave from a different city (Providence RI, not Boston) and land in a different city (Dublin, not Shannon) and the trip would happen on a different day. I try to go with the flow, but that was a lot.</p>\n<h1 id=\"week-1\">Week 1 <a class=\"direct-link\" href=\"#week-1\">#</a></h1>\n<p>The whole reason we can do this trip is Herself's folks have an apartment and car in Killarney Ireland. Our trip would be about 2 days long if we had to pay for hotels and car rentals. This trip was different because Herself's sister (twin, ie Spare Parts) has relocated back to Ireland and is getting set up with her new life, so therefore is living in said apartment, driving said car. It is great to send time with her, and the boys eat up any time they get with her. It was a flashback to the days when she often lived with us in some cramped apartment outside of Boston.</p>\n<p>I spent the first week commuting with La Twin to the next town over, Tralee, where she works at the university. I found a co-working space downtown that was very accommodating. Being a long time remote worker (a decade +), it's always a nice change of pace to work in an office, talk to folks, get tasty lunches out. Tralee is a really neat irish city, much less touristy than Killarney. I didn't make any new BFFs, like I did last trip (love you, Declan).</p>\n<h1 id=\"week-2\">Week 2 <a class=\"direct-link\" href=\"#week-2\">#</a></h1>\n<p>We always do an extended trip to Herself's people in Collooney (County Sligo). There is about 100 relatives around and every night is something. Big dinners, night at the pub, bonfire, just lots going on. We did some amazing hikes (Queen Maeve's grave was the highlight). My brother-in-law and his family (who live 30 minutes away and we see every month or so) made the trek too were visiting this week as well. Even though we see them often, it was great to do this adventure with them. Probably the highlight of the week was going with an uncle to see a cousin play Gaelic football in Dublin's Croke Park, a massive stadium. The game was on national TV, but watching it live was amazing.</p>\n<h1 id=\"week-3\">Week 3 <a class=\"direct-link\" href=\"#week-3\">#</a></h1>\n<p>Picked up La Twin and headed down to south west County Kerry, to the old home of La Granny. It's one of my favorite places on earth. It's a cottage, with some pastures (currently housing two horses) in front of it, and then Ireland ends. Off the coast you can see the Skellig Islands. You can barely see your neighbors house, and it's a good 20 minutes of driving on single lane roads to get to a place to buy milk/coffee/newspaper. A high-end restaurant/cafe opened up nearby, it's about an hour's walk along cliff roads to get to it. Amazing. We went out for our anniversary there and was able to have late night drinks with the couple who own it. Super fun night.</p>\n<p>This was a work week for me, so it was back to co-working offices. Ireland has invested a bunch of resources to attract folks like me; remote workers who want/can spend extended time in the country so long as they have a place to work. It makes sense because visitors tend to spend lots of money, I assume, but it felt weird working in a completely empty rural office. I got the feel for what it might be like to live there. Commuting on small roads, dodging the occasional on coming car or cyclist (yikes). Listening to Irish morning radio. Becoming a regular at the local shop where I seek yet more caffeine and sweets. I liked it but it was a bit lonely. We couldn't be arsed to cook at night so often we went to the pub or a world class restaurant, because why not?</p>\n<h1 id=\"week-4\">Week 4 <a class=\"direct-link\" href=\"#week-4\">#</a></h1>\n<p>Last week of the trip. A mix of looking forward to returning to the creature comforts of home, and knowing that you'll probably not be back here for a while. We tried to squeeze as much as we could in. Hikes on the Gap of Dunloe and Torc Mountain (the latter with the kids). Hit up an aqua park, which the kids love. More nights at the pub and Herself got to meet Declan finally. La Twin took us to a whiskey bar that was right up my alley. I took the kids to the horrible summer amusement park and tried not to get ripped off by too many ride attendants. It was tough to leave La Twin, the kids really enjoyed the time with her.</p>\n<p>The flight back was uneventful, which was rare for that time frame. Most the larger euro airports were plagued by lines and delays. A couple weeks before the BIL flew out of Dublin. They arrived four hours early, the plan was delayed by one hour, and they still <em>bareley</em> made the flight. Nuts. I was able to split from my fam in Boston and go to a dear co-workers retirement party, which meant a lot to me. I managed to stay awake for 30ish hours, fueled by good company and drink.</p>\n<p>I don't know how often we will be able to get back, but goodness do we feel blessed to be able to have and give the experience to our kids.</p>\n<p>Sláinte</p>\n",
      "date_published": "2022-07-02T00:00:00Z"
    },{
      "id": "https://jeffcoburn.com/posts/weeknotes/06-13-2022/",
      "url": "https://jeffcoburn.com/posts/weeknotes/06-13-2022/",
      "title": "WeekNotes - June 13, 2022",
      "content_html": "<p>Team Coburn is temporarily located in County Kerry, Ireland. Thanks to some generous drop-offs and and pick-ups, the travel was pretty easy. Still some sleep issues, bodies despise the concept of timezones. So far we've had very typical Irish weather. It's cloudy and always on the verge of raining without actually raining.</p>\n<p>I'm of two minds over the pros/cons of working 5 hours ahead of everyone. On one hand, I love a few hours of uninterrupted work before folks come online stateside. But I do struggle shutting it down at the end of the day, because there are so many open threads that aren't closed when I should be ending work.</p>\n<p>It's nice traveling and &quot;living&quot; in a new place. It's one thing to be a tourist and see the sites, it's another to commute to a workplace, find your preferred coffee place and make friends with your temporary co-workers.</p>\n<p>I thought maybe being abroad might give a bit of reprieve from the sense that the world is collapsing, but no. The news is bad everywhere.</p>\n<h2 id=\"watched\">watched <a class=\"direct-link\" href=\"#watched\">#</a></h2>\n<ul>\n<li>Formula 1</li>\n<li>NBA Finals (Celtics are down 3-2 but I really think they are capable of winning this thing)</li>\n</ul>\n<h2 id=\"read\">Read <a class=\"direct-link\" href=\"#read\">#</a></h2>\n<p>?????</p>\n<h2 id=\"did\">Did <a class=\"direct-link\" href=\"#did\">#</a></h2>\n<ul>\n<li>Traveled 5 timezones with young children</li>\n<li>Started working out of <a href=\"https://hqkerry.com/locations/hq-tralee/\">HQ-Tralee</a></li>\n</ul>\n",
      "date_published": "2022-06-13T00:00:00Z"
    },{
      "id": "https://jeffcoburn.com/posts/weeknotes/06-06-2022/",
      "url": "https://jeffcoburn.com/posts/weeknotes/06-06-2022/",
      "title": "WeekNotes - June 6, 2022",
      "content_html": "<p>Been a minute. This week is all about finishing up the last week of school for the kiddos and getting ready to go to Ireland for the first half of the summer. We are so fortunate to have this opportunity. Lou's folks (in theory) split time between here (US) and there (IRE), so we have access to a condo and a car. Lou takes all of her vacation time in one go, and I work half the time. I've had really good luck at co-working places; meeting folks and forging friendships, in the past. I know the kids won't/don't appreciate it now, but I'm sure they will appreciate the memories.</p>\n<p>Getting ready for an extended international trip is a bit stressful. Duh.</p>\n<h2 id=\"did\">Did <a class=\"direct-link\" href=\"#did\">#</a></h2>\n<ul>\n<li>I played my one-ish round of golf for the year and sucked less than usual.</li>\n<li>Have enjoyed the Celtics play-off (championship?) run. Ronan has even started to care a little bit. As a life-long fan, and avid watcher of this current Celtics core, it's hard for me to grasp that we have finally arrived at a championship caliber team. Do you like how I said &quot;we&quot;? When you've watched as many games and typed as many emails to your hometown friends about last nights game as I have, you get to say &quot;we&quot;.</li>\n<li>Trying to do some actually programming and problem solving in React. As somebody who accidentally became a frontend developer, React feels a little too close to computer science.</li>\n</ul>\n<h2 id=\"watched\">Watched <a class=\"direct-link\" href=\"#watched\">#</a></h2>\n<ul>\n<li>Lou and I watched <em>Severence</em> and probably have the same opinion as most folks. Little slow with a big pay-off.</li>\n<li>Watched the animated series <em>Arcane</em> based on <a href=\"https://marcamos.com/\">Marc's</a> recommendation. Super cool animation style and surprisingly emotional.</li>\n<li>Watched Marvel's <em>Shang-Chi and the Legend of the Ten Rings</em> with the kiddos and thought that was pretty fun. Nice to see more diversity in super hero movies.</li>\n<li>We started Watching <em>Kenobi</em> as a family but Wes really hates the constant flashbacks to Anakin's burnt up body. I tend to agree with him. We get it Ben, it was a real bummer, man.</li>\n</ul>\n<h2 id=\"read\">Read <a class=\"direct-link\" href=\"#read\">#</a></h2>\n<ul>\n<li>Finished Martha Wells' <em>Network Effect: A Murderbot Novel</em> . I've read all the novellas up to this full novel. Really fun reads.</li>\n<li>Getting near finishing Neal Stephenson's <em>Termination Shock</em>. It is about near-future climate change. Very enlightening, but given Neal's ability to predict the future, it's sort of shit-your-pants terrifying.</li>\n</ul>\n",
      "date_published": "2022-06-06T00:00:00Z"
    },{
      "id": "https://jeffcoburn.com/posts/weeknotes/01-02-2022/",
      "url": "https://jeffcoburn.com/posts/weeknotes/01-02-2022/",
      "title": "WeekNotes - Dec 28, 2021",
      "content_html": "<p>Just finishing up The Most Wonderful Time of the Year and it's carnage all around. We had a few visitors and one of them tested positive for Covid the next day. Her family had a fairly comprehensive outbreak, but somehow we seemed to have dodged a bullet (we are pfizer vaxed and moderna boosted, if anybody thinks that is the secret sauce). But, we had to spend the majority of our time quarantined because we didn't want to risk getting anybody else sick. Two screen-obsessed kids, terrible weather, and no Yuletide cheer means we head into the new year the opposite of whatever &quot;ready to kill it&quot; means.</p>\n<p>Judging by the headlines it seems we should get used to being at home. Goodie.</p>\n<h3 id=\"did\">did <a class=\"direct-link\" href=\"#did\">#</a></h3>\n<ul>\n<li>Got ruby, rbenv, jekyll, node, npm, and 11ty all playing nice on the new M1.</li>\n<li>Actually got my site running.</li>\n<li>Watched my kiddos do some pretty complex lego builds. Color me impressed.</li>\n<li>Rearranged our living room for the 39th time. For some reason, setting our living room up into something that works for everyone is our Sagrada Família (in that it takes two centuries to finish and hundreds of people died in the making).</li>\n<li>Did some dog-sitting. Dogs are the best.</li>\n</ul>\n<h3 id=\"watched\">watched <a class=\"direct-link\" href=\"#watched\">#</a></h3>\n<ul>\n<li><em>Matrix Resurrections</em>. I really like the first half the movie. It was pretty much a remix of The Matrix, but well done.</li>\n<li><em>Spider-Man: Far from Home</em>. I Liked it. Lots or easter eggs (daredevil!?) and callbacks. They make them so emotional now, I feel bad for my kids who just want to see Spider-Man flip kick bad guys in the face but have to watch bad things happen to good people x 100.</li>\n<li><em>Don't Look Up</em>. One of those movies where the trailer was probably better. Seemed like it was going for Doctor Strange Love for the modern age.</li>\n</ul>\n<h3 id=\"read\">read <a class=\"direct-link\" href=\"#read\">#</a></h3>\n<ul>\n<li>Finished <em>Freedom™</em> by Daniel Suarez. This is the follow up to <em>Daemon</em>.</li>\n<li>Started <em>Snow Crash</em>. I remember this being very important to me in my early 20's, and I've told countless people how great a book it is. The other day Herself asked me what it was about and I couldn't remember. Hopefully it is as good as I remember.</li>\n</ul>\n",
      "date_published": "2022-01-02T00:00:00Z"
    },{
      "id": "https://jeffcoburn.com/posts/2021/",
      "url": "https://jeffcoburn.com/posts/2021/",
      "title": "2021",
      "content_html": "<hr>\nI've had worse years (actually just one, and it was last year), but I'm glad to be done with this year.  I'm sure my year was roughly like yours. I wish I was somebody who achieved crazy goals during all this time at home, but I'm more just trying to help keep all of our family's heads above water. I like the fact that I can be more present with my family. I do miss going to Boston and seeing my work chums. Consistent fitness remains illusive, and some of my larger goals are still years off schedule.\n<p>Here are some highlights, in no particular order.</p>\n<ul>\n<li>Restarted my personal website(RIP jetsetbingo)</li>\n<li>Kids went back to school</li>\n<li>Sorta kinda got better at living day-to-day in a pandemic</li>\n<li>Paid off the other car</li>\n<li>tore out the old busted gas fireplace insert (my FIL drywalled like an ace)</li>\n<li>Got a new mountain bike and <em>sent it</em> (with the appropriate caution of a mid 40's dad)</li>\n<li>Got the kids started with skiing and they <em>sent it</em> (did a bit more myself)</li>\n<li>Hit a few pub runs and did a 5k</li>\n<li>Had some heat pumps (mini splits to some) installed - they are great, make the house much warmer</li>\n<li>Saw my folks and travelled to VA to see my sister.</li>\n<li>Family trip to VT and Niagara Falls.</li>\n<li>Took the kids to NYC for the first time. They were entertained for about 45 minutes.</li>\n<li>Gave the kids decent pandemic birthdays (we are getting better at this)</li>\n<li>Travelled to Kingdom Trails/VT for Noel's annual birthday MTB trip</li>\n<li>Started drinking more bourbon (I guess that is a highlight, I may look back and regret this)</li>\n<li>Got W more help with his disability/ability issues.</li>\n<li>Started coaching R's hoops team (I love basketball and love helping kids get better at it)</li>\n<li>Got a new dev machine up and running (got 7 years out of my old MBP)</li>\n<li>Continued to read a decent amount of books per year (I was previously not an avid reader)</li>\n<li>Continued to connect with a nice peer group of devs via our slack group</li>\n<li>Played <em>a lot</em> of fortnite with nice peer group of devs (and by myself).</li>\n</ul>\n<h2 id=\"goals-for-2022\">Goals for 2022 <a class=\"direct-link\" href=\"#goals-for-2022\">#</a></h2>\n<ul>\n<li>Find some sort of fitness I enjoy. I've never just worked out for it's own sake. I should try and find an activity I like doing. I'm sure this will go great</li>\n<li>Grow this site: I want to document things I do, learn, and read</li>\n<li>Find ways to relax that won't destroy my mind/body</li>\n<li>Renew some expired certs</li>\n<li>Do some camping</li>\n<li>Send it on my bike/skis</li>\n<li>Head back to Ireland for a spell?</li>\n</ul>\n<p>Here's hoping 2022 isn't another bag of face-chewing rats!</p>\n",
      "date_published": "2022-01-01T00:00:00Z"
    },{
      "id": "https://jeffcoburn.com/posts/til/njk-in-vscode/",
      "url": "https://jeffcoburn.com/posts/til/njk-in-vscode/",
      "title": "TIL - Get Nunjuck files to use HTML syntax highlighting in VSCode",
      "content_html": "<p>Out of the box VSCode doesn't use syntax highlighting on nunjucks files. To fix that</p>\n<ul>\n<li>Open up settings</li>\n<li>Search for &quot;file associations&quot;</li>\n<li>Click &quot;add item&quot;</li>\n<li>Under 'item' uses '*.njk' and under 'value' use 'html'</li>\n<li>???</li>\n<li>Profit</li>\n</ul>\n",
      "date_published": "2021-12-30T00:00:00Z"
    },{
      "id": "https://jeffcoburn.com/posts/weeknotes/06-01-2021/",
      "url": "https://jeffcoburn.com/posts/weeknotes/06-01-2021/",
      "title": "WeekNotes - June 1, 2021",
      "content_html": "<h3 id=\"read\">Read <a class=\"direct-link\" href=\"#read\">#</a></h3>\n<ul>\n<li>\n<p>Finished reading <a href=\"https://www.goodreads.com/en/book/show/54211065-2034\"><em>2034: A Novel of the Next World War</em><br>\n</a>. A nice blend of what could happen in the future sprinkled in with how this has already happened many times over in history. If you have anxiety about &quot;current affairs&quot; probably give it a miss.</p>\n</li>\n<li>\n<p>Finished Reading <a href=\"https://www.goodreads.com/book/show/44767458-dune\"><em>Dune</em></a>. I saw the movie trailer and felt like this is one of those books I should have read, so I did. Like all good sci-fi, this is pretty timeless. Definitely, not written with any female perspective whatsoever but not sure you can expect much from something written in 1965. I don't plan to read the rest of the series.</p>\n</li>\n<li>\n<p><a href=\"https://postlight.com/insights/best-of-today-i-learned-in-2021-so-far?utm_source=Postlight+Newsletter&amp;utm_campaign=6e6fab17ea-POSTLIGHT_NEWSLETTER_5_5_2021_16_53_COPY_01&amp;utm_medium=email&amp;utm_term=0_e2a2d77b7f-6e6fab17ea-177179785\">Today I leaned -Postlight </a></p>\n</li>\n</ul>\n",
      "date_published": "2021-06-01T00:00:00Z"
    },{
      "id": "https://jeffcoburn.com/posts/weeknotes/05-24-2021/",
      "url": "https://jeffcoburn.com/posts/weeknotes/05-24-2021/",
      "title": "WeekNotes - May 24, 2021",
      "content_html": "<p>Like <a href=\"https://alicebartlett.co.uk/blog/weaknotes\">Alice</a>, <a href=\"https://danmall.com/weeknotes/2021-05-23/\">Dan</a>, and <a href=\"https://www.builtwith.coffee/blog/1\">Joe</a>, I'm would like to make this a thing.</p>\n<p>###[Computers]</p>\n<ul>\n<li>\n<p>Built a <a href=\"https://www.11ty.dev\">11ty</a> site with a <a href=\"https://forestry.io\">Forestry.io</a> backend. So far I'm happy with the improvements from using <a href=\"https://www.netlifycms.org\">Netlify CMS</a> (not <a href=\"https://www.netlify.com\">netlify</a> the deployment service, which is one of the most brilliant products released in the last decade. Creating a custom content type, and adding an editor was pretty painless. I've been using Jekyll for almost a decade, but keeping a ruby stack running along side my javascript stuff has gotten to be too much of an ass-ache.</p>\n</li>\n<li>\n<p>Watched some of <a href=\"https://mybuild.microsoft.com/home\">Build 2021</a>, Microsoft's developer conference. We are, of course, very post-the-time-things-made-any-sense, but it still feels weird the Microsoft is eating everybody's lunch when it comes to supporting a development community.</p>\n</li>\n<li>\n<p>Tried to build something that seems doable in <a href=\"https://public.tableau.com/s/\">Tableau Public</a>, but so far it's Fail City, might take another shot at it this week.</p>\n</li>\n</ul>\n<p>###[Home Life]</p>\n<ul>\n<li>\n<p>Getting W some home with his social/emotional skills. This has been an unkind year for him.</p>\n</li>\n<li>\n<p>Planted some grass. I hate landscaping and abhor competing with neighbors, but my yards is just a pile of dirt where chipmunks dwell. I went with with a hardy grass that has clover mixed in. Clover is not in style this century, but it appeals to me in that: it grows, it's green, and when you mow it, the clippings are nitrate (food) for the grass it is mixed in with.</p>\n</li>\n</ul>\n<p>###[Consumed]</p>\n<ul>\n<li>\n<p>Finished season 2 of &quot;For All Mankind.&quot; Herself and I are both really into it.</p>\n</li>\n<li>\n<p>Watch the first few episodes of Season 2 of Mythic Quest. I really really loved the two eps they did while in quarantine, but this season is really drilling down on how flawed the characters are. Much more of a &quot;Always Sunny&quot; vibe, which doesn't really fit with what I want right now.</p>\n</li>\n<li>\n<p>Watched &quot;Master of None&quot; Season 3. Very very different from the first two seasons. It was well done, but removing the Dev character was pretty predictable way to handle Aziz's own fall from grace.</p>\n</li>\n</ul>\n",
      "date_published": "2021-05-24T00:00:00Z"
    }
  ]
}
